{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title"},{"path":["body"],"id":"body","weight":1,"src":"body"}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"SHKO(Save Hong Kong Online)","n":0.5},"1":{"v":"\n[![Great Extinction](./assets/extinctions.jpeg)](https://hongkongfp.com/2021/11/28/explainer-over-50-groups-gone-in-11-months-how-hong-kongs-pro-democracy-forces-crumbled/) \n(_Courtesy: Hong Kong Freepress, 2021_)\n\nSHKO (Save Hong Kong Online) is a community project to preserve those disappearing online web sites since 2019~ and on. It's anonymous and open source, with the support from a lot of online users. \n\n\n## Goals\n- To preserve as much information as possible before its disappearance during Hong Kong's great transition\n- To illustrate a viable method that everyone can use to help preserve online heritage with no pains\n- To demonstrate global collaborations to save local digital heritages with best practices\n\n\n## Quick Facts\n\nWe are working on over dozens of [[websites or online causes | sites]] in Hong Kong in the past two decades which has been forced to shutdown or at the brink of disappearing:\n\nExamples:\n- [[sites.appledaily]] (Extincted)\n- [[sites.inmediahk]] (In Danger)\n\n\n\n","n":0.089}}},{"i":2,"$":{"0":{"v":"Sponsorship","n":1},"1":{"v":"\n\n## Sharing\n\nYour simplest donation is to share this web site to your friends and social circles to let them know about the project and how much you care about the heritages. \n\n## Donation\n\nPlease use cryptocurrency to support this project. We encourage you to convert fiat currencies(HKD, USD, etc.) into cryptocurrency before you send to this project.\n\nThe donations will be used fully to this preservation project, to maintain its longevity, including but not limited to:\n\n- infrastructure and to pay for the hosting servers\n- development and maintenance costs\n- data collection cost from the participants\n\n\n## Helps from Global Organizations\n\n- Filecoin Foundation\n- Starling Lab\n- China Digital Times\n- Wikimedia Foundation\n- Internet Archive \n","n":0.096}}},{"i":3,"$":{"0":{"v":"Collections","n":1},"1":{"v":"\n\n1. [[sites.hkcnews]]\n2. [[sites.inmediahk]]\n3. [[sites.appledaily]]\n4. [[sites.factwire]]\n5. [[sites.standnews]]\n6. [[sites.hkfp]]\n7. [[sites.hkja]])\n8. [[sites.post852]]\n9. [[sites.Hkfeature]]\n10. [[sites.hongkongwatch]]\n11. [[sites.pori]]\n\n\n\n","n":0.289}}},{"i":4,"$":{"0":{"v":"Stand News (立場新聞)","n":0.577},"1":{"v":"\n\n\n\n\n## URLs\n- https://www.thestandnews.com (offline)\n- Web page collection from Internet Archive:\nhttps://web.archive.org/web/*/https://www.thestandnews.com\n- http://standnews.co.uk/ (British edition)\n","n":0.277}}},{"i":5,"$":{"0":{"v":"Post852","n":1},"1":{"v":"\n《852郵報》（Post 852）是香港的一個網上媒體，於2013年成立，由前《信報》前副總編輯袁耀清（筆名游清源）等人組成的評論、博客與互動新媒體平台，其政治立場偏向親泛民主派。2021年5月15日，因應《國安法》制定，該網媒正式停止運作。(URL: https://www.post852.com)\n\nPost 852 was founded in 2013 by Yuen Yiu Ching, former deputy chief editor of Hong Kong Economic Journal. The website focused on commentaries, blogging and user interactions. In terms of politica stance, it is pro-democracy. On 15 May 2021, the website was shut down in view of the coming into force of the National Security Law. (URL: https://www.post852.com)","n":0.128}}},{"i":6,"$":{"0":{"v":"Hong Kong Public Opinion Research Institute","n":0.408},"1":{"v":"\nHong Kong Public Opinion Research Institute (HKPORI) was officially registered as a limited company on February 19, 2019, began to operate symbolically on May 4 of the same year, and then began to operate officially and independently on July 1 of the same year. The core values of the HKPORI are science and democracy, both of which are important pillars of humanity. HKPORI stands firm on its social conscience, emulates the world’s top public opinion research institutions, and serves the public with its best knowledge and conscientiousness. --\n\n\n","n":0.107}}},{"i":7,"$":{"0":{"v":"Inmediahk 獨立媒體","n":0.707},"1":{"v":"\n>\n獨立媒體，2020年12月10日前稱香港獨立媒體（英語：Hong Kong In-media）是一個以香港為基地的網媒，網站主要內容為時事評論，涉及不同社會政治及文化議題。-- [Wikipedia](https://zh.wikipedia.org/wiki/%E7%8D%A8%E7%AB%8B%E5%AA%92%E9%AB%94_inmediahk.net)\n\nFounded in 2004, Hong Kong In-media is an independent news & media platform for democratic and social movement. The platform centres on a wide range of social, political and cultural issues of Hong Kong.\n\nOfficial site: https://www.inmediahk.net/\n\n![Inmedia HK Frontpage](./assets/frontpage_inmedia.png)\n\n\n\n## Archives \n\n- WACZ([[howto]]):\n    - Latest(2022-3-10): [2022-3-10.wacz](https://bafybeieldyl7quzpuqldxbs7ib7th43bkjhcx3vl4b3gvdbkn57mzzpneq.ipfs.dweb.link/fixtures/inmediahk-03_30_2022.wacz)\n    - Previous: \n        - 2022-2-10:\n        - 2022-1-09:\n\n- Internet Archive:\n    - https://web.archive.org/web/*/https://www.inmediahk.net/\n\n","n":0.131}}},{"i":8,"$":{"0":{"v":"Hong Kong Watch","n":0.577}}},{"i":9,"$":{"0":{"v":"The Hong Kong Journalists Association","n":0.447},"1":{"v":"\n\nThe Hong Kong Journalists Association(香港記者協會) was established in 1968 for practising journalists in Hong Kong \"to enhance press freedom and the integrity of news coverage\". -- [Wikipedia](https://en.wikipedia.org/wiki/Hong_Kong_Journalists_Association)\n\n\n\n","n":0.192}}},{"i":10,"$":{"0":{"v":"Hong Kong Free Press","n":0.5},"1":{"v":"\n>\nFounded in 2015, Hong Kong Free Press is an impartial, non-profit, award-winning English-language newspaper.\nRun by journalists, backed by readers and 100% independent, HKFP is governed by a public code of ethics.","n":0.18}}},{"i":11,"$":{"0":{"v":"Hk Feature","n":0.707},"1":{"v":"--\n誌 HK FEATURE 由前明周記者關震海，於2019年創立，以記錄為主，專注並持續的詳盡的報道香港議題，集結成專題。\n\nHK Feature was founded by Kwan Chun Hoi in 2019. It is one of the few media outlets that mainly use feature stories to cover events in Hong Kong, providing its own insight that is thought-provoking for readers of different political positions.","n":0.149}}},{"i":12,"$":{"0":{"v":"Hkctu","n":1},"1":{"v":"\n香港職工會聯盟（簡稱職工盟；英語：Hong Kong Confederation of Trade Unions，縮寫作 HKCTU）是一個已經解散的工會組織。成立於1990年7月，曾領導多場工人運動，高峰時有90多個屬會，超過19萬名會員。截止2021年10月會員大會表決解散前有78個屬會，曾為香港最大工會聯合組織之一。職工盟總部位於香港九龍彌敦道557至559號永旺行7樓及19樓。職工盟解散前主席為代表黃迺元、李卓人為秘書長。職工盟的四大綱領為團結、尊嚴、公義、民主。 2021年9月17日，文匯報報道，9月16日晚職工盟舉行執委會會議，會議通過啟動解散程序的決定，並將於10月3日召開會員大會正式通過解散。報道又指，自2012年起擔任總幹事的蒙兆達，已宣布辭職。2021年10月3日，職工盟主席黃迺元會後見記者指，大會以57票贊成、8票反對及2票棄權，大比數通過解散。擁有31年歷史的職工盟正式步入歷史。(URL: http://www.hkctu.org.hk/， 已失效)\n\nThe Hong Kong Confederation of Trade Unions (HKCTU) is a defunct trade union organisation. Founded in July 1990, it led a number of labour movements and at its peak had more than 90 affiliated unions with over 190,000 members. It had 78 affiliates by the time of its dissolution in October 2021, and was once one of the largest trade union federations in Hong Kong. The head office of the CTU was located on the 7th and 19th floors of Aeon Hong Kong, 557-559 Nathan Road, Kowloon, Hong Kong. The former Chairman of the HKCTU is Representative Wong Nai-yuen, and Lee Cheuk-yan is the Secretary General. The four main platforms of the HKCTU are unity, dignity, justice and democracy. On 17 September 2021, Wen Wei Po reported that the executive committee of the HKCTU held a meeting on the evening of 16 September and approved the decision to initiate the dissolution process, and that a general meeting would be held on 3 October to formally endorse the dissolution. Reportedly, Mr Mong Siu-tat, who has been the General Secretary since 2012, has announced his resignation. Speaking to reporters after the meeting on 3 October 2021, HKCTU Chairman Wong Nai-yuen said the dissolution was approved by a majority of 57 votes in favour, 8 against and 2 abstentions. The 31-year old HKCTU was officially dissolved. (URL： http://www.hkctu.org.hk/, inaccessible)","n":0.065}}},{"i":13,"$":{"0":{"v":"Citizen News(眾新聞)","n":0.707}}},{"i":14,"$":{"0":{"v":"Hka","n":1},"1":{"v":"\n香港市民支援愛國民主運動聯合會，簡稱支聯會或港支聯， 是香港曾經一個泛民主派政治組織，於1989年5月21日在香港支持八九民運的全球華人大遊行中成立，設有包括「釋放民運人士、平反八九民運」等在內的五大綱領，首屆主席由司徒華擔任。1990年至2019年，支聯會曾連續30年無間斷舉辦六四遊行、維園燭光集會。高峰期時，泛民主派有約一半的立法會議員同時身兼支聯會成員身份。2021年9月25日，特別會員大會通過解散決議。(URL: http://www.alliance.org.hk/, invalid) (FB Page: https://www.facebook.com/hkalliance)\n\nThe Hong Kong Alliance in Support of Patriotic Democratic Movements of China was a pro-democracy organisation that was established on 21 May 1989 in the then British colony of Hong Kong during the 1989 Tiananmen Square protests and massacre in Beijing. After the 4 June massacre, the organisation main goals were the rehabilitation of the democracy movement and the accountability for the massacre. The main activities the organisation held were the annual memorials and commemorations, of which the candlelight vigil in Victoria Park was the most attended, reported and discussed event each year. Due to its stance, the Central government in Beijing considers the organisation subversive. Three leaders, including its vice chairwoman Chow Hang-tung were arrested on other national security charges on 9 September 2021, and its assets were frozen. The Alliance finally decided to dissolve on 25 September after all standing committee members were remanded in custody or jailed. (URL: http://www.alliance.org.hk/, invalid) (FB Page: https://www.facebook.com/hkalliance)\n","n":0.079}}},{"i":15,"$":{"0":{"v":"Guhkst","n":1},"1":{"v":"​香港言語治療師總工會（職工會登記編號：1357）於2019年11月29日刊憲正式成立。工會宗旨為「捍衛公義、團結業界、促進溝通、爭取權益」。根據傳媒報道，工會擁有約二百名成員，佔該行業專業人員總數的六分之一。2021年7月，工會5名成員，包括黎雯齡（25歲）、楊逸意（27歲）、伍巧怡（28歲）、陳源森（25歲）及方梓皓（26歲）涉嫌串謀刊印、發佈、分發、展示或複製煽動刊物罪被捕。所涉刊物包括《羊村守衛者》、《羊村十二勇士》和《羊村清道夫》。2021年10月13日，香港政府撤銷該工會之登記。\n(URL: https://www.guhkst.org/)\n\nThe General Union of Hong Kong Speech Therapists was founded on 29 November 2019 with a mission to advocate justice, unite professionals in the trade, promote communication and defend rights. In July 2021, four of the union's former members, Lai Man-ling, Melody Yeung, Sidney Ng, Samuel Chan and Marco Fong were arrested by national security police. They were accused of publishing and distributing three children's books, _Guardians of the Sheep Village_, _12 Warriors of the Sheep Village_, and _Dustman of the Sheep Village_, to “bring into hatred or contempt or to excite disaffection” against the Hong Kong government and “the administration of justice in Hong Kong” .\nOn 13 October 2021, the government of the HKSAR revoked the registration of the union. (URL: https://www.guhkst.org/)\n","n":0.09}}},{"i":16,"$":{"0":{"v":"Factwire","n":1},"1":{"v":"\n傳真社（英語：FactWire）是一間位於香港的調查性新聞通訊社，為非牟利的新聞機構，於2015年8月18日成立，2016年3月1日正式運作。傳真社以專注調查報道作為主要傳播模式，調查報道獲各多間香港主流新聞媒體採用。通訊社由三千三百名香港市民集資創辦。(URL: https://www.factwire.org)\n\nFactWire is an investigative news agency headquartered in Kowloon, Hong Kong. 3,300 Hong Kong residents funded and founded FactWire in the first round of seed fund via the crowdfunding platform FringeBacker in 2015. As a non-profit public service news agency, it was established on 18 August 2015, and became operational on 1 March 2016. FactWire mainly focuses on watchdog investigative reporting wired to a large number of Hong Kong's mainstream news outlets. (URL: https://www.factwire.org/en/)","n":0.115}}},{"i":17,"$":{"0":{"v":"Cusu","n":1},"1":{"v":"\n香港中文大學學生會（英語：Student Union of The Chinese University of Hong Kong），是曾於香港中文大學運作的學生會。根據《香港中文大學學生會會章》，其宗旨為「本民主自治精神，為團結各同學，促進德、智、體、群、美之發展，謀求福利之增進，溝通同學與校方之關係，以及服務社會」。該會成立於1971年3月19日，2021年10月7日，中大學生會於其 Facebook 專頁宣布，考量學生最大利益下，決定解散學生會，代表會所有代表請辭，惟相關解散宣告及後於2021年11月7日被司法委員會推翻。2021年11月7日，司法委員會裁定中文大學學生會代表會及/或學生會聯席會議解散學生會之宣告違憲並無效，且宣布中文大學學生會聯席會議應該重啟學生會職務。(FB page: https://www.facebook.com/CUHK.SU)\n\nThe Student Union of The Chinese University of Hong Kong is a student union that used to operate in The Chinese University of Hong Kong. According to the Charter of the Student Union of The Chinese University of Hong Kong, its mission is \"to unite students in the spirit of democratic self-government, to promote moral, intellectual, physical, social and aesthetic development, to seek the advancement of welfare, to communicate with the University, and to serve the community\". On 7 October 2021, the Student Union announced on its Facebook page that it had decided to dissolve the union in the best interests of students and that all representatives of the Student Union had resigned, but the dissolution was subsequently overturned by the Judicial Committee on 7 November 2021. On 7 November 2021, the Judicial Committee ruled that the dissolution of the Student Union by the Representative Council and/or the Conference was unconstitutional and invalid, and declared that the Conference of Student Union should re-activate the Student Union. (FB page: https://www.facebook.com/CUHK.SU)","n":0.074}}},{"i":18,"$":{"0":{"v":"Apple Daily 蘋果日報","n":0.577},"1":{"v":"\n>\nApple Daily was a newspaper published in Hong Kong from 1995 to 2021. Founded by Jimmy Lai, it was one of the best-selling Chinese language newspapers in Hong Kong. Along with entertainment magazine Next Magazine, Apple Daily was part of Next Digital. The paper published print and digital editions in Traditional Chinese, as well as a digital-only English edition. A sister publication of the same name remains operational online in Taiwan under a joint venture between Next Digital and other Taiwanese companies.\nOn 23 June 2021, the newspaper said it would close \"in view of staff members' safety\" and the print run of 24 June would be its last. Apple Daily also said its digital version would go offline at 23:59 Hong Kong Time on 23 June.\n\n《蘋果日報》（英語：Apple Daily）是香港上市公司壹傳媒旗下的繁體中文報紙，由黎智英於1995年創立，是香港的主要中文報章。蘋果日報於2021年由於林鄭月娥政府以《中華人民共和國香港特別行政區維護國家安全法》拘捕多名高層並被凍結《蘋果日報》的資金，造成資金斷裂，被迫停刊。\n\n\n![Apple Daily Frontpage](./assets/frontpage_appledaily.jpg)\n_(Screenshot of Apple Daily Frontpage,  Courtesy: coconuts.co)_\n\n\n## Archives\n- [Apple Daily On Internet Archive](https://web.archive.org/web/*/https://hk.appledaily.com/)\n\n","n":0.084}}},{"i":19,"$":{"0":{"v":"Participation","n":1},"1":{"v":"\nWe need volunteers to help us to build a better digital society, and first of all, preserving the digital heritage from Hong Kong. Please join us with your discretion and please don't hesitate to contact us if you have any questions.\n\n## Prerequisites\n\n- Understand the risks participating such project\n- Knows how to protect your identity with secure communication tools(e.g. Signal), and anonymity tools(e.g. Tor)\n- Familiar with engineering tools(e.g. Git, Docker, etc.)\n\n## This is to show some changes made by M on 13 April 2022 at 15:07","n":0.108}}},{"i":20,"$":{"0":{"v":"How To Archive and Replay","n":0.447},"1":{"v":"\n\n## Archive single pages\n\n- Internet Archive (https://archive.org/web/)\n    - We strongly suggest your installing [the Internet Archive plugin for browsers](https://github.com/internetarchive/wayback-machine-webextension) to save any web pages handily. \n- Webrecorder Archive (https://webrecorder.net/tools#archivewebpage)\n\n## Archive the whole site\n\nIf you are a developer, you can run up this docker container(https://github.com/webrecorder/browsertrix-crawler) to save a web site as a whole. The saved site will be compressed into a single file as a snapshot from the specific date(time). The file is in a popular compression format called [WACZ](https://webrecorder.github.io/wacz-spec/1.1.1/). \n\n\n## Replay the artifacts\n\n- Download the artifact above(caution: it's a large file)\n\nDownload the artifact file,normal in the format of .wacz, then put into a local folder(Alert: the file could be a huge one up to xx GB). \n\n- Open ReplayWeb (https://replayweb.page)\n\nOnce it downloaded, you can use the following link to replay the sites: https://replayweb.page/. E.g.  \n\n\n- View and search\n\nSelect the file you downloaded to view the whole site and search for specific content.\n\n\n\n\n","n":0.081}}},{"i":21,"$":{"0":{"v":"Background","n":1},"1":{"v":"\nSince 2020, Hong Kong has been imposed a National Security Law by the central government, given the strong backslash from the local and international communities. \n\nAfter NSL was put into practice, the civil society has suffered huge losses by not only losing key activists but also their projects and public information channels. \n\nThe idea was from a common concern mounted from a series of crackdowns in Hong Kong and disappearance of many media outlets, as well Non-governmental organizations. The list is growing longer and longer with no time to respond by civil society, especially on how to preserve their legacy content and valuable history documents, whether in digital or traditional formats. \n\n\nA team of digital activists are working on an new initiative, collaborating with this project, to develop some open tools to preserve these historical cluster of content, and set up an example and model to be used by any similar social/political environment. \n\nThe goal of this initiative, dubbed as Save Hong Kong Online(SHKO) as such, is to collect the extinct content from those organizations and create an online archive at the beginning, then technologies will be used to keep the content last for a visible duration(10 years and on), and eventually shared and safeguarded by public crowd. \n\nThe extending goal of the project is to make such a preservation a common model by open-source all the details(except the participant's private information). Hence it can be reused by other similar projects. \n","n":0.064}}}]}
